RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_ll_tim.h
/** @defgroup TIM_LL_EC_TIM3_TI2_RMP  TIM3 External Input Ch2 Remap
  * @{
  */
#define LL_TIM_TIM3_TI2_RMP_GPIO                0x00000000UL                                       /*!< TIM3 TI2 is connected to GPIO */
#define LL_TIM_TIM3_TI2_RMP_COMP1               TIM_TISEL_TI2SEL_0                                 /*!< TIM3 TI2 is connected to COMP1 output */
#define LL_TIM_TIM3_TI2_RMP_COMP2               TIM_TISEL_TI2SEL_1                                 /*!< TIM3 TI2 is connected to COMP2 output */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM4_TI1_RMP  TIM4 External Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM4_TI1_RMP_GPIO                0x00000000UL                                       /*!< TIM4 TI1 is connected to GPIO */
#define LL_TIM_TIM4_TI1_RMP_COMP1               TIM_TISEL_TI1SEL_0                                 /*!< TIM4 TI1 is connected to COMP1 output */
#define LL_TIM_TIM4_TI1_RMP_COMP2               TIM_TISEL_TI1SEL_1                                 /*!< TIM4 TI1 is connected to COMP2 output */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM4_TI2_RMP  TIM4 External Input Ch2 Remap
  * @{
  */
#define LL_TIM_TIM4_TI2_RMP_GPIO                0x00000000UL                                       /*!< TIM4 TI2 is connected to GPIO */
#define LL_TIM_TIM4_TI2_RMP_COMP1               TIM_TISEL_TI2SEL_0                                 /*!< TIM4 TI2 is connected to COMP1 output */
#define LL_TIM_TIM4_TI2_RMP_COMP2               TIM_TISEL_TI2SEL_1                                 /*!< TIM4 TI2 is connected to COMP2 output */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM5_TI1_RMP  TIM5 External Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM5_TI1_RMP_GPIO               0x00000000UL                                       /*!<  TIM5 TI1 is connected to GPIO */
#define LL_TIM_TIM5_TI1_RMP_LSI                TIM_TISEL_TI1SEL_0                                 /*!<  TIM5 TI1 is connected to LSI */
#define LL_TIM_TIM5_TI1_RMP_LSE                TIM_TISEL_TI1SEL_1                                 /*!<  TIM5 TI1 is connected to LSE */
#define LL_TIM_TIM5_TI1_RMP_RTC                (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)          /*!<  TIM5 TI1 is connected to RTC Wakeup */
#define LL_TIM_TIM5_TI1_RMP_COMP1              TIM_TISEL_TI1SEL_2                                 /*!<  TIM5 TI1 is connected to COMP1 output */
#define LL_TIM_TIM5_TI1_RMP_COMP2              (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)          /*!<  TIM5 TI1 is connected to COMP2 output */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM5_TI2_RMP  TIM5 External Input Ch2 Remap
  * @{
  */
#define LL_TIM_TIM5_TI2_RMP_GPIO               0x00000000UL                                       /*!< TIM5 TI2 is connected to GPIO */
#define LL_TIM_TIM5_TI2_RMP_COMP1              TIM_TISEL_TI2SEL_0                                 /*!< TIM5 TI2 is connected to COMP1 output */
#define LL_TIM_TIM5_TI2_RMP_COMP2              TIM_TISEL_TI2SEL_1                                 /*!< TIM5 TI2 is connected to COMP2 output */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM8_TI1_RMP  TIM8 External Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM8_TI1_RMP_GPIO               0x00000000UL                                       /*!< TIM8 TI1 is connected to GPIO */
#define LL_TIM_TIM8_TI1_RMP_COMP1              TIM_TISEL_TI1SEL_0                                 /*!< TIM8 TI1 is connected to COMP1 output */
#define LL_TIM_TIM8_TI1_RMP_COMP2              TIM_TISEL_TI1SEL_1                                 /*!< TIM8 TI1 is connected to COMP2 output */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM15_TI1_RMP  TIM15 External Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM15_TI1_RMP_GPIO              0x00000000UL                                       /*!< TIM15 TI1 is connected to GPIO */
#define LL_TIM_TIM15_TI1_RMP_LSE               TIM_TISEL_TI1SEL_0                                 /*!< TIM15 TI1 is connected to LSE */
#define LL_TIM_TIM15_TI1_RMP_COMP1             TIM_TISEL_TI1SEL_1                                 /*!< TIM15 TI1 is connected to COMP1 output */
#define LL_TIM_TIM15_TI1_RMP_COMP2             (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)          /*!< TIM15 TI1 is connected to COMP2 output */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM15_TI2_RMP  TIM15 External Input Ch2 Remap
  * @{
  */
#define LL_TIM_TIM15_TI2_RMP_GPIO              0x00000000UL                                       /*!< TIM15 TI2 is connected to GPIO */
#define LL_TIM_TIM15_TI2_RMP_COMP2              TIM_TISEL_TI1SEL_0                                /*!< TIM15 TI2 is connected to COMP2 output */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM16_TI1_RMP  TIM16 External Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM16_TI1_RMP_GPIO              0x00000000UL                                                   /*!< TIM16 TI1 is connected to GPIO */
#define LL_TIM_TIM16_TI1_RMP_MCO               TIM_TISEL_TI1SEL_1                                             /*!< TIM16 TI1 is connected to MCO */
#define LL_TIM_TIM16_TI1_RMP_HSE_DIV32         (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)                      /*!< TIM16 TI1 is connected to HSE DIV32 */
#define LL_TIM_TIM16_TI1_RMP_RTC               TIM_TISEL_TI1SEL_2                                             /*!< TIM16 TI1 is connected to RTC */
#define LL_TIM_TIM16_TI1_RMP_LSE               (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                      /*!< TIM16 TI1 is connected to LSE */
#define LL_TIM_TIM16_TI1_RMP_LSI               (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)                      /*!< TIM16 TI1 is connected to LSI */
#define LL_TIM_TIM16_TI1_RMP_MSIS_1024         (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM16 TI1 is connected to MSIS/1024 */
#define LL_TIM_TIM16_TI1_RMP_MSIS_4             TIM_TISEL_TI1SEL_3                                            /*!< TIM16 TI1 is connected to MSIS/4 */
#define LL_TIM_TIM16_TI1_RMP_HSI_256           (TIM_TISEL_TI1SEL_3 | TIM_TISEL_TI1SEL_0)                      /*!< TIM16 TI1 is connected to HSI/256 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM17_TI1_RMP  TIM17 External Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM17_TI1_RMP_GPIO              0x00000000UL                                                   /*!< TIM17 TI1 is connected to GPIO */
#define LL_TIM_TIM17_TI1_RMP_MCO               TIM_TISEL_TI1SEL_1                                             /*!< TIM17 TI1 is connected to MCO */
#define LL_TIM_TIM17_TI1_RMP_HSE_DIV32         (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)                      /*!< TIM17 TI1 is connected to HSE DIV32 */
#define LL_TIM_TIM17_TI1_RMP_RTC               TIM_TISEL_TI1SEL_2                                             /*!< TIM17 TI1 is connected to RTC */
#define LL_TIM_TIM17_TI1_RMP_LSE               (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)                      /*!< TIM17 TI1 is connected to LSE */
#define LL_TIM_TIM17_TI1_RMP_LSI               (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)                      /*!< TIM17 TI1 is connected to LSI */
#define LL_TIM_TIM17_TI1_RMP_MSIS_1024         (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0) /*!< TIM17 TI1 is connected to MSIS/1024 */
#define LL_TIM_TIM17_TI1_RMP_MSIS_4             TIM_TISEL_TI1SEL_3                                            /*!< TIM17 TI1 is connected to MSIS/4 */
#define LL_TIM_TIM17_TI1_RMP_HSI_256           (TIM_TISEL_TI1SEL_3 | TIM_TISEL_TI1SEL_0)                       /*!< TIM17 TI1 is connected to HSI/256 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_OCREF_CLR_INT OCREF clear input selection
  * @{
  */
#define LL_TIM_OCREF_CLR_INT_ETR         OCREF_CLEAR_SELECT_MSK                   /*!< OCREF_CLR_INT is connected to ETRF */
#define LL_TIM_OCREF_CLR_INT_COMP1       0x00000000U                              /*!< OCREF clear input is connected to COMP1_OUT */
#define LL_TIM_OCREF_CLR_INT_COMP2       TIM1_AF2_OCRSEL_0                        /*!< OCREF clear input is connected to COMP2_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_INDEX_DIR index direction selection
  * @{
  */
#define LL_TIM_INDEX_UP_DOWN     0x00000000U         /*!< Index resets the counter whatever the direction */
#define LL_TIM_INDEX_UP          TIM_ECR_IDIR_0      /*!< Index resets the counter when up-counting only */
#define LL_TIM_INDEX_DOWN        TIM_ECR_IDIR_1      /*!< Index resets the counter when down-counting only */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_INDEX_BLANK index blanking selection
  * @{
  */
#define LL_TIM_INDEX_BLANK_ALWAYS     0x00000000U         /*!< Index always active */
#define LL_TIM_INDEX_BLANK_TI3        TIM_ECR_IBLK_0      /*!< Index disabled when TI3 input is active, as per CC3P bitfield */
#define LL_TIM_INDEX_BLANK_TI4        TIM_ECR_IBLK_1      /*!< Index disabled when TI4 input is active, as per CC4P bitfield */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_INDEX_POSITION index positioning selection
  * @{
  */
#define LL_TIM_INDEX_POSITION_DOWN_DOWN    0x00000000U                           /*!< Index resets the counter when AB = 00 */
#define LL_TIM_INDEX_POSITION_DOWN_UP      TIM_ECR_IPOS_0                        /*!< Index resets the counter when AB = 01 */
#define LL_TIM_INDEX_POSITION_UP_DOWN      TIM_ECR_IPOS_1                        /*!< Index resets the counter when AB = 10 */
#define LL_TIM_INDEX_POSITION_UP_UP        (TIM_ECR_IPOS_1 | TIM_ECR_IPOS_0)     /*!< Index resets the counter when AB = 11 */
#define LL_TIM_INDEX_POSITION_DOWN         0x00000000U                           /*!< Index resets the counter when clock is 0 */
#define LL_TIM_INDEX_POSITION_UP           TIM_ECR_IPOS_0                        /*!< Index resets the counter when clock is 1 */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_FIRST_INDEX first index selection
  * @{
  */
#define LL_TIM_INDEX_ALL           0x00000000U                           /*!< Index is always active */
#define LL_TIM_INDEX_FIRST_ONLY    TIM_ECR_FIDX                          /*!< The first Index only resets the counter */
/**
  * @}
  */
/** @defgroup TIM_LL_EC_PWPRSC Pulse on compare pulse width prescaler
  * @{
  */
#define LL_TIM_PWPRSC_X1     0x00000000U                                              /*!< Pulse on compare pulse width prescaler 1 */
#define LL_TIM_PWPRSC_X2     TIM_ECR_PWPRSC_0                                         /*!< Pulse on compare pulse width prescaler 2 */
#define LL_TIM_PWPRSC_X4     TIM_ECR_PWPRSC_1                                         /*!< Pulse on compare pulse width prescaler 4 */
#define LL_TIM_PWPRSC_X8     (TIM_ECR_PWPRSC_1 | TIM_ECR_PWPRSC_0)                    /*!< Pulse on compare pulse width prescaler 8 */
#define LL_TIM_PWPRSC_X16    TIM_ECR_PWPRSC_2                                         /*!< Pulse on compare pulse width prescaler 16 */
#define LL_TIM_PWPRSC_X32    (TIM_ECR_PWPRSC_2 | TIM_ECR_PWPRSC_0)                    /*!< Pulse on compare pulse width prescaler 32 */
#define LL_TIM_PWPRSC_X64    (TIM_ECR_PWPRSC_2 | TIM_ECR_PWPRSC_1)                    /*!< Pulse on compare pulse width prescaler 64 */
#define LL_TIM_PWPRSC_X128   (TIM_ECR_PWPRSC_2 | TIM_ECR_PWPRSC_1 | TIM_ECR_PWPRSC_0) /*!< Pulse on compare pulse width prescaler 128 */
/**
  * @}
  */

/** Legacy definitions for compatibility purpose
@cond 0
  */
#define LL_TIM_BKIN_SOURCE_DFBK  LL_TIM_BKIN_SOURCE_DF1BK
/**
@endcond
  */
/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup TIM_LL_Exported_Macros TIM Exported Macros
  * @{
  */

/** @defgroup TIM_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */
/**
  * @brief  Write a value in TIM register.
  * @param  __INSTANCE__ TIM Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_TIM_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG((__INSTANCE__)->__REG__, (__VALUE__))

/**
  * @brief  Read a value in TIM register.
  * @param  __INSTANCE__ TIM Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_TIM_ReadReg(__INSTANCE__, __REG__) READ_REG((__INSTANCE__)->__REG__)
/**
  * @}
  */

